package data;

// Данные для оформления заказа
public class OrderData {

    public static Object[][] data() {
        return new Object[][]{
                {
                        "top",
                        "Иван",
                        "Иванов",
                        "Москва, Ленина 1",
                        "Сокольники",
                        "+79991234567",
                        "25.06.2026",
                        "сутки",
                        "black",
                        "Позвонить заранее"
                },
                {
                        "top",
                        "Анна",
                        "Петрова",
                        "Москва, Тверская 10",
                        "Черкизовская",
                        "+79997654321",
                        "26.06.2026",
                        "двое суток",
                        "grey",
                        "Оставить у подъезда"
                },
                {
                        "bottom",
                        "Иван",
                        "Иванов",
                        "Москва, Ленина 1",
                        "Сокольники",
                        "+79991234567",
                        "25.06.2026",
                        "сутки",
                        "black",
                        "Позвонить заранее"
                },
                {
                        "bottom",
                        "Анна",
                        "Петрова",
                        "Москва, Тверская 10",
                        "Черкизовская",
                        "+79997654321",
                        "26.06.2026",
                        "двое суток",
                        "grey",
                        "Оставить у подъезда"
                }
        };
    }
}
